Revit 2027 API
ModuleStatus Enumeration
 The Macro module status.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ModuleStatus
Public Enumeration ModuleStatus
public enum class ModuleStatus
type ModuleStatus
Members
Member name | Value | Description
BuildFailed | 1 |  Failed to build the module.
Corrupt | 4 |  The module is corrupt.
Disabled | 3 |  The module is disabled.
Loaded | 0 |  The module is loaded.
LoadFailed | 2 |  Failed to load the module.
NotBuild | 5 |  The module is not build.
See Also
Reference
Autodesk.Revit.DB.Macros Namespace